app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("action", "description", "created_at", "updated_at", "completion_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["action", "charge ipad"], ["description", "charge until 100% "], ["created_at", "2018-09-23 02:59:05.987600"], ["updated_at", "2018-09-23 02:59:05.987600"], ["completion_date", "2018-09-25"]]

  def update
    @task = Task.find_by(id: params[:id])

    if @task.nil?
      head :not_found
    end

    is_updated = @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-27"], ["updated_at", "2018-09-24 06:15:44.785443"], ["id", 9]]

    task = Task.find_by(id: params[:id])

    if task.nil?
      head :not_found
    end

    if task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 23]]

  def complete
    @task = Task.find_by(id: params[:id])

    if @task.nil?
      head :not_found
    end

    @task.update_attribute(:completed, true)
    @task.update_attribute(:completion_date, Date.today)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = $1, "completion_date" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2018-09-22 00:24:49.119394"], ["completion_date", "2018-09-21"], ["id", 11]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2018-09-23 02:59:37.064671"], ["id", 18]]

  def incomplete
    @task = Task.find_by(id: params[:id])

    if @task.nil?
      head :not_found
    end

    @task.update_attribute(:completed, false)
    @task.update_attribute(:completion_date, nil)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2018-09-23 02:51:25.090715"], ["id", 13]]
UPDATE "tasks" SET "updated_at" = $1, "completion_date" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2018-09-23 02:51:43.440571"], ["completion_date", "2018-09-22"], ["id", 12]]